latex/IntroductionToCommutativeAlgebra/IntroductionToCommutativeAlgebra.tex
% Created 2020-06-22 一 00:46
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\input{../preamble.tex}
\setcounter{secnumdepth}{1}
\author{Atiyah \& Macdonald}
\date{\today}
\title{Introduction To Commutative Algebra}
\hypersetup{
 pdfauthor={Atiyah \& Macdonald},
 pdftitle={Introduction To Commutative Algebra},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents \clearpage\section{Rings and Ideals}
\label{sec:org070d898}
A \textbf{unit} is an element \(u\) with a \textbf{reciprocal} \(1/u\) or the
\textbf{multiplicative inverse}. The units form a multiplicative group, denoted
\(R^\times\)

A ring \textbf{homomorphism}, or simply a \textbf{ring map}, \(\varphi:R\to R'\) is a map
preserving sum, products and 1

If there is an unspecified isomorphism between rings \(R\) and \(R'\), then we
write \(R=R'\) when it is \textbf{canonical}; that is, it does not depend on any
artificial choices.

A subset \(R''\subset R\) is a \textbf{subring} if \(R''\) is a ring and the
inclusion \(R''\hookrightarrow R\) is a ring map. In this case, we call \(R\)
a \textbf{(ring) extension}.

An \textbf{\(R\)-algebra} is a ring \(R'\) that comes equipped with a ring map
\(\varphi:R\to R'\), called the \textbf{structure map}, denoted by \(R'/R\). For
example, every ring is canonically a \(\Z\)-algebra. An
\textbf{\(R\)-algebra homomorphism}, or \textbf{\(R\)-map}, \(R'\to R''\) is a ring map
between \(R\)-algebras.

A group \(G\) is said to \textbf{act} on \(R\) if there is a homomorphism given from
\(G\) into the group of automorphism of \(R\). The \textbf{ring of invariants}
\(R^G\) is the subring defined by
\begin{equation*}
R^G:=\{x\in R\mid gx=g\text{ for all }g\in G\}
\end{equation*}

Similarly a group \(G\) is said to \textbf{act} on \(R'/R\) if \(G\) acts on \(R'\)
and each \(g\in G\) is an \(R\)-map. Note that \(R'^G\) is an \(R\)-subalgebra

\subsection*{Boolean rings}
\label{sec:org3ffacf2}
The simplest nonzero ring has two elements, 0 and 1. It's denoted \(\F_2\)


Given any ring \(R\) and any set \(X\), let \(R^X\) denote the set of
functions \(f:X\to R\). Then \(R^X\) is a ring.

For example, take \(R:=\F_2\). Given \(f:X\to R\), put \(S:=f^{-1}\{1\}\).
Then \(f(x)=1\) if \(x\in S\). In other words, \(f\) is the \textbf{characteristic
function} \(\chi_S\). Thus \emph{the characteristic functions form a ring, namely}, \(\F_2^X\)

Given \(T\subset X\), clearly \(\chi_S\cdot\chi_T=\chi_{S\cap T}\).
\(\chi_S+\chi_T=\chi_{S\triangle T}\), where \(S\triangle T\) is the
\textbf{symmetric difference}:
\begin{equation*}
S\triangle T:=(S\cup T)-(S\cap T)
\end{equation*}
Thus \emph{the subsets of \(X\) form a ring: sum is symmetric difference, and}
\emph{product is intersection. This ring is canonically isomorphic to \(\F_2^X\)}

A ring \(B\) is called \textbf{Boolean} if \(f^2=f\) for all \(f\in B\). If so, then
\(2f=0\) as \(2f=(f+f)^2=f^2+2f+f^2=4f\)

Suppose \(X\) is a topological space, and give \(\F_2\) the \textbf{discrete}
topology; that is, every subset is both open and closed. Consider the
continuous functions \(f:X\to\F_2\). Clearly, they are just the \(\chi_S\)
where \(S\) is both open and closed.

\subsection*{Polynomial rings}
\label{sec:org3f1ebc0}
Let \(R\) be a ring, \(P:=R[X_1,\dots,X_n]\). \(P\) has this \textbf{Universal
Mapping Property} (UMP): \emph{given a ring map \(\varphi:R\to R'\) and given an}
\emph{element \(x_i\) of \(R'\) for each \(i\), there is a unique ring map}
\emph{\(\pi:P\to R'\) with \(\pi|R=\varphi\) and \(\pi(X_i)=x_i\).} In fact, since
\(\pi\) is a ring map, necessarily \(\pi\) is given by the formula:
\begin{equation}
\pi(\sum a_{(i_1,\dots,i_n)}X_1^{i_1}\dots X_n^{i_n})=\sum
\varphi(a_{(i_1,\dots,i_n)})x_1^{i_1}\dots x_n^{i_n}\label{eq1.3.1}
\end{equation}
In other words, \(P\) is universal among \(R\)-algebras equipped with a list
of \(n\) elements

Similarly let \(\calx:=\{X_\lambda\}_{\lambda\in\Lambda}\) be any set of
variables. Set \(P':=R[\calx]\); the elements of \(P'\) are the polynomials
in any finitely many of the \(X_\lambda\). \(P'\) has essentially the same
UMP as \(P\)

\subsection*{Ideals}
\label{sec:orgfc3ee0a}
Let \(R\) be a ring. A subset \(\fa\) is called an \textbf{ideal} if
\begin{enumerate}
\item \(0\in\fa\)
\item whenever \(a,b\in\fa\), also \(a+b\in\fa\)
\item whenever \(x\in R\) and \(a\in\fa\) also \(xa\in\fa\)
\end{enumerate}


Given a subset \(\fa\subset R\), by the ideal \(\la\fa\ra\) that \(\fa\)
\textbf{generates}, we mean the smallest ideal containing \(\fa\)

All ideal containing all the \(a_\lambda\) contains any (finite) \textbf{linear
combination} \(\sum x_\lambda a_\lambda\) with \(x_\lambda\in R\) and almost
all 0.

Given a single element \(a\), we say that the ideal \(\la a\ra\) is
\textbf{principal}

Given a number of ideals \(\fa_\lambda\), by their \textbf{sum} \(\sum\fa_\lambda\)
we mean the set of all finite linear combinations \(\sum x_\lambda
   a_\lambda\) with \(x_\lambda\in R\) and \(a_\lambda\in\fa_\lambda\)

Given two ideals \(\fa\) and \(\fb\), by the \textbf{transporter} of \(\fb\) into
\(\fa\) we mean the set
\begin{equation*}
(\fa:\fb):=\{x\in R\mid x\fb\subset\fa\}
\end{equation*}
\((\fa:\fb)\)  is an ideal. Plainly,
\begin{equation*}
\fa\fb\subset\fa\cap\fb\subset\fa+\fb,\quad\fa,\fb\subset\fa+\fb,\quad
\fa\subset(\fa:\fb)
\end{equation*}
Further, for any ideal \(\fc\), the distributive law holds:
\(\fa(\fb+\fc)=\fa\fb+\fa\fc\)

Given an ideal \(fa\), notice \(\fa=R\) \emph{if and only if} \(1\in\fa\). It
follows that \(\fa=R\) iff \(\fa\) contains a unit.

Given a ring map \(\varphi:R\to R'\), denote by \(\fa R'\) or \(\fa^e\) the
ideal of \(R'\) generated by the set \(\varphi(\fa)\). We call it the
\textbf{extension} of \(\fa\)

Given an ideal \(\fa'\) of \(R'\), its preimage \(\varphi^{-1}(\fa')\) is an
ideal of \(R\). We call \(\varphi^{-1}(\fa')\) the \textbf{contraction} of \(\fa'\)
and sometimes denote it by \(\fa'^c\)

\subsection*{Residue rings}
\label{sec:org52682ce}
\textbf{kernel} \(\ker(\varphi)\) is defined to be the ideal \(\varphi^{-1}(0)\) of
\(R\)

Let \(\fa\) be an ideal of \(R\). Form the set of cosets of \(\fa\)
\begin{equation*}
R/\fa:=\{x+\fa\mid x\in R\}
\end{equation*}
\(R/\fa\) is called the \textbf{residure ring} or \textbf{quotient ring} or \textbf{factor ring} of
\(R\) \textbf{modulo} \(\fa\). From the \textbf{quotient map}
\begin{equation*}
\kappa:R\to R/\fa\quad\text{ by }\kappa x:=x+\fa
\end{equation*}
The element \(\kappa x\in R/\fa\) is called the \textbf{residure} of \(x\).

If \(\ker(\varphi)\supset\fa\), \emph{then there is a ring map} \(\psi:R/\fa\to R'\)
\emph{with} \(\psi\kappa=\varphi\); that is, the following diagram is commutative

\begin{center}
\begin{tikzcd}
R\arrow[r,"\kappa"]\arrow[dr,"\varphi"]&R/\fa\arrow[d,"\psi"]\\
&R'
\end{tikzcd}
\end{center}
by \(\psi(x\fa)=\varphi(x)\). Then we only need to verify that \(\psi\) is a map

Conversely, \emph{if \(\psi\) exists, then} \(\ker(\varphi)\supset\fa\), \emph{or}
\(\varphi\fa=0\), \emph{or} \(\fa R'=0\), since \(\kappa\fa=0\)

Further, \emph{if \(\psi\) exists, then \(\psi\) is unique} as \(\kappa\) is surjective

Finally, as \(\kappa\) is surjective, \emph{if \(\psi\) exists, then \(\psi\) is surjective}
\emph{iff \(\psi\) is so}. In addition, \(\psi\) \emph{is injective iff \(\fa=\ker(\varphi)\)}.
Hence \(\psi\) \emph{is an isomorphism iff \(\varphi\) is surjective and}
\(\fa=\ker(\varphi)\). Therefore,
\begin{equation*}
R/\ker(\varphi)\xrightarrow{\sim}\im(\varphi)
\end{equation*}

\(R/\fa\) has UMP: \(\kappa(\fa)=0\), and given \(\varphi:R\to R'\) s.t.
\(\varphi:R\to R'\) s.t. \(\varphi(\fa)=0\), there is a unique ring map
\(\psi:R/\fa\to R'\) s.t. \(\psi\kappa=\varphi\). In other words, \(R/\fa\)
is universal among \(R\)-algebras \(R'\) s.t. \(\fa R'=0\)

If \(\fa\) is the ideal generated by elements \(a_\lambda\),then the UMP can
be usefully rephrased as follows: \(\kappa(a_\lambda)=0\) for all \(\lambda\),
and given \(\varphi:R\to R'\) s.t. \(\varphi(a_\lambda)=0\) for all \(\lambda\),
there is a unique ring map \(\psi:R/\fa\to R'\) s.t. \(\psi\kappa=\varphi\)

\emph{The UMP serves to determine} \(R/\fa\) \emph{up to unique isomorphism}.
Say \(R'\), equipped with \(\varphi:R\to R'\) has the UMP too.
\(\kappa(\fa)=0\) so there is a unique \(\psi':R'\to R/\fa\) with
\(\psi'\varphi=\kappa\). Then \(\psi'\psi\kappa=\kappa\). Hence
\(\psi'\psi=1\) by uniqueness. Thus \(\psi\) and \(\psi'\) are inverse isomorphism
\begin{center}
\begin{tikzcd}
&&R/\fa\arrow[dd,"1"]\arrow[dl,"\psi"]\\
R\arrow[urr,"\kappa"]\arrow[r,"\varphi"]\arrow[drr,"\kappa"]&
R'\arrow[dr,"\psi'"]&\\
&&R/\fa
\end{tikzcd}
\end{center}

\begin{proposition}[]
Let \(R\) be a ring, \(P:=R[X]\), \(a\in R\) and \(\pi:P\to R\) the
\(R\)-algebra map defined by \(\pi(X):=a\). Then
\begin{enumerate}
\item \(\ker(\pi)=\{F(X)\in P\mid F(a)=0\}=\la X-a\ra\)
\item \(R/\la X-a\ra\simeq R\)
\end{enumerate}
\end{proposition}

\begin{proof}
Set \(G:=X-a\). Given \(F\in P\), let's show \(F=GH+r\) with \(H\in P\) and
\(r\in R\). By linearity, we may assume \(F:=X^n\). If \(n\ge1\), then
\(F=(G+a)X^{n-1}\), so \(F=GH+aX^{n-1}\) with \(H:=X^{n-1}\).

Then \(\pi(F)=\pi(G)\pi(H)+\pi(r)=r\). Hence \(F\in\ker(\pi)\) iff \(F=GH\). But
\(\pi(F)=F(a)\) by \ref{eq1.3.1}
\end{proof}


\subsection*{Degree of a polynomial}
\label{sec:org6cb078c}
Let \(R\) be a ring, \(P\) the polynomial ring in any number of variables.
If \(F\) is a monomial \(\bM\), then its degree \(\deg(\bM)\) is the sum of
its exponents; in general, \(\deg(F)\) is the largest \(\deg(\bM)\) of all
monomials \(\bM\) in \(F\)

Given any \(G\in P\) with \(FG\) nonzero, notice that
\begin{equation*}
\deg(FG)\le\deg(F)+\deg(G)
\end{equation*}

\subsection*{Order of a polynomial}
\label{sec:org0980c22}
Let \(R\) be a ring, \(P\) the polynomial ring in variable \(X_\lambda\) for
\(\lambda\in\Lambda\), and \((x_\lambda)\in R^\Lambda\) a vector. Let
\(\varphi_{(x_\lambda)}:P\to P\) denote the \(R\)-algebra map defined by
\(\varphi_{(x_\lambda)}X_\mu:=X_\mu+x_\mu\) for all \(\mu\in\Lambda\). Fix a
nonzero \(F\in P\)

The \textbf{order} of \(F\) at the zero vector \((0)\), denoted \(\ord_{(0)}F\), is
defined as the smallest \(\deg(\bM)\) of all the monomials \(\bM\) in \(F\).
In general, the \textbf{order} of \(F\) at the vector \((x_\lambda)\), denoted
\(\ord_{(x_\lambda)}F\) is defined by the formula: \(\ord_{(x_\lambda)}F:=\ord_{(0)}(\varphi_{(x_\lambda)}F)\)

Notice that \(\ord_{(x_\lambda)}F=0\) iff \(F(x_\lambda)\neq0\) as \((\varphi_{x_\lambda}F)(0)=F(x_\lambda)\)

Given \(\mu\) and \(x\in R\), form \(F_{\mu,x}\) by substituting \(x\) for \(X_\mu\)
in \(F\). If \(F_{\mu,x_\mu}\neq0\) , then
\begin{equation*}
\ord_{(x_\lambda)}F\le\ord_{(x_\lambda)}F_{\mu,x_\mu}\label{eq1.8.1}
\end{equation*}
If \(x_\mu=0\), then \(F_{\mu,x_\mu}\) is the sum of the terms without
\(x_\mu\) in \(F\). Hence if \((x_\lambda)=(0)\), then \ref{eq1.8.1} holds. But
substituting 0 for \(X_\mu\) in \(\varphi_{(x_\lambda)}F\) is the same as
substituting \(x_\mu\) for \(X_\mu\) in \(F\) and then applying
\(\varphi_{(x_\lambda)}\) to the result; that is,
\((\varphi_{(x_\mu)}F)_{\mu,0}=\varphi_{(x_\lambda)}F_{\mu,x_\mu}\)

Given any \(G\in P\) with \(FG\) nonzero,
\begin{equation*}
\ord_{(x_\lambda)}FG\ge\ord_{(x_\lambda)}F+\org_{(x_\lambda)}G
\end{equation*}

\subsection*{Nested ideals}
\label{sec:org1264a72}
Let \(R\) be a ring, \(\fa\) an ideal, and \(\kappa:R\to R/\fa\) the quotient map.
Given an ideal \(\fb\supset\fa\), form the corresponding set of cosets of
\(\fa\)
\begin{equation*}
\fb/\fa:=\{b+\fa\mid b\in\fb\}=\kappa(\fb)
\end{equation*}
Clearly, \(\fb/\fa\) is an ideal of \(R/\fa\). Also \(\fb/\fa=\fb(R/\fa)\)

Given an ideal \(\fb\supset\fa\), form the composition of the quotient maps
\begin{equation*}
\varphi:R\to R/\fa\to (R/\fa)/(\fb/\fa)
\end{equation*}
\(\varphi\) is surjective and \(\ker(\varphi)=\fb\). Hence \(\varphi\) factors
\begin{center}
\begin{tikzcd}
R\arrow[r]\arrow[d]&R/\fb\arrow[d,"\psi","\simeq"']\\
R/\fa\arrow[r]&(R/\fa)/(\fb/\fa)
\end{tikzcd}
\end{center}

\subsection*{Idempotents}
\label{sec:orgecd79b9}
Let \(R\) be a ring. Let \(e\in R\) be an \textbf{idempotent}; that is, \(e^2=e\).
Then \(Re\) is a ring with \(e\) as 1.

\subsection*{Exercise}
\label{sec:org571cfce}
\begin{exercise}
\label{ex1.13}
Let \(\varphi:R\to R'\) be a map of rings, \(\fa_1,\fa_2,\fa_3\) ideals of \(R\),
\(\fb_1,\fb_2,\fb_3\) ideals of \(R'\). Prove
\begin{enumerate}
\item \((\fa_1+\fa_2)^e=\fa_1^e+\fa_2^e\)
\end{enumerate}
\end{exercise}
\end{document}
